/*
Задание: Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть функция вернет true, а если нет - false.
*/


public class Main {
    public static void main(String[] args) {
        //напишите тут ваш код
        //System.out.println(compare(-9,88));
    }
        static boolean compare(int a,int b) {
        return a+b>10;
    }
}
