/*
Задание: Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false.
*/


public class Main {
    public static void main(String[] args) {
        //напишите тут ваш код
        //System.out.println(compare(4,4));
    }
        static boolean compare(int a,int b) {
        return a==b;
    }
}

